<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.1Password</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/passwordmanagers</string>
		<key>NAME</key>
		<string>1Password</string>
		<key>extract_icon</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>1Password Browser Helper.app</string>
				<string>1Password Helper (Renderer).app</string>
				<string>1Password Helper (GPU).app</string>
				<string>1Password Launcher.app</string>
				<string>1Password Helper (Plugin).app</string>
				<string>1Password Updater.app</string>
				<string>1Password.app</string>
				<string>1Password Helper.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The world’s most-loved password manager

1Password is the easiest way to store and use strong passwords. Log in to sites and fill forms securely with a single click.</string>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.1Password</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.download.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>263825c5f3a845978631da45336cf1b3f04f1727</string>
				<key>path</key>
				<string>/Users/Shared/PSU Demos/AutoPkg/RecipeRepos/com.github.autopkg.datajar-recipes/1Password/1Password.download.recipe</string>
				<key>sha256_hash</key>
				<string>b72c900ad7d21a133d6207efffacb7e9ae6e9115ac4f131def89e170da760912</string>
			</dict>
			<key>com.github.dataJAR-recipes.munki.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>263825c5f3a845978631da45336cf1b3f04f1727</string>
				<key>path</key>
				<string>/Users/Shared/PSU Demos/AutoPkg/RecipeRepos/com.github.autopkg.datajar-recipes/1Password/1Password.munki.recipe</string>
				<key>sha256_hash</key>
				<string>3240cf7d77c0d6c3c53340c787c04fd71e1336e57cc4180d09152e704c7916ff</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
