<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.AdobeReader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeReader</string>
		<key>OS_VERSION</key>
		<string>Mac OS 12.0</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.AdobeReader</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>AdobeReaderRepackager</key>
			<dict>
				<key>git_hash</key>
				<string>a28e56e90ebc52512a4b7ec8fe1981bf02e92bc5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderRepackager.py</string>
				<key>sha256_hash</key>
				<string>1d0a60834b41201e740c8fb828862a3a81495718b6bf30bd3a755756333242b5</string>
			</dict>
			<key>AdobeReaderURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>a28e56e90ebc52512a4b7ec8fe1981bf02e92bc5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderURLProvider.py</string>
				<key>sha256_hash</key>
				<string>f72864ef777f92b182fc3fcdabc212e6e8f4d544888e6308ddcdbdd8cd3e6fb6</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.AdobeReader</key>
			<dict>
				<key>git_hash</key>
				<string>77b681c7361eedad1bc33f9388e5de1f65b43154</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReader.download.recipe</string>
				<key>sha256_hash</key>
				<string>0b3e1c9009478a054a886edcaab84c009dc49c9889db8efd06b25132fd24572d</string>
			</dict>
			<key>com.github.autopkg.pkg.AdobeReader</key>
			<dict>
				<key>git_hash</key>
				<string>77b681c7361eedad1bc33f9388e5de1f65b43154</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReader.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>cfa17e33ddfdab221d470cb96fe18f8889bc6b5082e97efd2c387f60150a080c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
