<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.download.Chrome-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Chrome</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jgstew.download.Chrome-Win</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.jgstew.SharedProcessors/AssertInputContainsString</key>
			<dict>
				<key>git_hash</key>
				<string>7d95b00373c4a5df1585d94ce9470d18820274ac</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/AssertInputContainsString.py</string>
				<key>sha256_hash</key>
				<string>51b02860738bbf45674d24cda953d6fe1926ce9fc071e69eab02e0fa4029a6bc</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/GoogleChromeUpdateInfoProvider</key>
			<dict>
				<key>git_hash</key>
				<string>b1fcb0623d079d75c7bb7141b5dcbcb548e9acac</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/GoogleChromeUpdateInfoProvider.py</string>
				<key>sha256_hash</key>
				<string>23598e538b89e6f17fdd4c7897ff40a7b475a558e2c033a83a114afd67913412</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/SharedUtilityMethods</key>
			<dict>
				<key>git_hash</key>
				<string>beda946908c7de8b24177305b26d71a2318495bf</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/SharedUtilityMethods.py</string>
				<key>sha256_hash</key>
				<string>d9f037acab119a338690bc6535ac965f5dad021d0b2d9438459625120de4b682</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/TextSearcher</key>
			<dict>
				<key>git_hash</key>
				<string>931b885b7c2a7ff4aae86b901b747783dad5d253</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/TextSearcher.py</string>
				<key>sha256_hash</key>
				<string>e9db3755af0d3012c651f51d5820e92f1f9368cd8538ea4e633918550024195b</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.jgstew.download.Chrome-Win</key>
			<dict>
				<key>git_hash</key>
				<string>b62ef6bbe93ad5e9aacd6872c3c56593080adb56</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/Google/Chrome-Win.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>92d7bb08f13002f1dbc7bdcad2ae4420ae0d48bc4d9332d9151fac75e0bec8a1</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
