<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.download.Docker</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>x86_64</string>
		<key>DOWNLOAD_TYPE</key>
		<string>amd64</string>
		<key>NAME</key>
		<string>Docker</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.smithjw.download.Docker</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged</key>
			<dict>
				<key>git_hash</key>
				<string>6f55eec37d1217ed2956b57a90c1993ed4ddfa16</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/StopProcessingIfDownloadUnchanged.py</string>
				<key>sha256_hash</key>
				<string>2293abf8fcb2870f1b45e63a27d51a3364f72fc6c911631bb6ddfec8b6201726</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/URLDownloaderPython</key>
			<dict>
				<key>git_hash</key>
				<string>8eaa294e961580527f351bb80ce0d03014d99bf3</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/URLDownloaderPython.py</string>
				<key>sha256_hash</key>
				<string>552f5d6f195cf9e56adb0146f14dc19d9480adb6f004f9cb66d68da339bc9e2b</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.smithjw.download.Docker</key>
			<dict>
				<key>git_hash</key>
				<string>23e422b637ffa227ddc2d304137c54a78d6bb0de</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Docker/Docker.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>651b6ced5f4b2c4de9a718af0e5ee12fe89990b8fe6df02b6d3c9315baa31349</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
