<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Eclipse</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>x86_64</string>
		<key>ECLIPSE_CODE</key>
		<string>java</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>developer</string>
		<key>NAME</key>
		<string>Eclipse</string>
		<key>SELECTION</key>
		<string>Eclipse IDE for Java Developers</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Developer</string>
			<key>description</key>
			<string>The essential tools for any Java developer, including a Java IDE, a CVS client, Git client, XML Editor, Mylyn, Maven integration...</string>
			<key>developer</key>
			<string>Eclipse Foundation</string>
			<key>display_name</key>
			<string>Eclipse IDE for Java Developers</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.Eclipse</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.Eclipse</key>
			<dict>
				<key>git_hash</key>
				<string>f502ee33f384b59d2712c5934b050ef2e606781d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Eclipse/Eclipse.download.recipe</string>
				<key>sha256_hash</key>
				<string>8d14bfa0935423f8db6e3f00cda5921fc3da34b51aa7f8c6616e46b4b7ed637d</string>
			</dict>
			<key>com.github.homebysix.munki.Eclipse</key>
			<dict>
				<key>git_hash</key>
				<string>e547270e347186a2225830245ba5949d78ae74fb</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Eclipse/Eclipse.munki.recipe</string>
				<key>sha256_hash</key>
				<string>868a7d087fc41d5aef28a629cbecb235f437af1cf431e4e9ecc28e87766bb718</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
