<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.download.Firefox-Mac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firefox</string>
		<key>OS</key>
		<string>osx</string>
		<key>filename</key>
		<string>Firefox.dmg</string>
		<key>product</key>
		<string>firefox-latest-ssl</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jgstew.download.Firefox-Mac</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.jgstew.SharedProcessors/BigFixPrefetchItem</key>
			<dict>
				<key>git_hash</key>
				<string>48be033b2667fcb1e25c931fbe2621f1a04c8a58</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/BigFixPrefetchItem.py</string>
				<key>sha256_hash</key>
				<string>33c523d4e2a671cb2749939386c61148da673c198a052df2b28894f5c66305f4</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary</key>
			<dict>
				<key>git_hash</key>
				<string>0c3244bdabd53cd9100a764740573994351c6e34</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/BigFixSetupTemplateDictionary.py</string>
				<key>sha256_hash</key>
				<string>7a43609b93110dd65e2c247f39effaa79d80a0e8930b6b0ec9bbcfbd1ce71d7f</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/DateTimeFromString</key>
			<dict>
				<key>git_hash</key>
				<string>eb6cdaaf4a8e1507f07af4d070f6d5caacb85da7</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/DateTimeFromString.py</string>
				<key>sha256_hash</key>
				<string>247b67c4430c6e9c2695ec28c4535c9e44291321029b756da67e10347bedaede</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/FileHasher</key>
			<dict>
				<key>git_hash</key>
				<string>eb8336aee4aeda06e91b92d5900e78d0b035affd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/FileHasher.py</string>
				<key>sha256_hash</key>
				<string>bcd2395611904833774694b3ddfe8fc23bcf4f5de8e6ecd653bdbcd752518dd8</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/TemplateDictionaryAppend</key>
			<dict>
				<key>git_hash</key>
				<string>eb8336aee4aeda06e91b92d5900e78d0b035affd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/TemplateDictionaryAppend.py</string>
				<key>sha256_hash</key>
				<string>e85bff3fc2d9d03a208ee92de15bfc620038e6799d5eedb90738382c3241aee3</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/TextSearcher</key>
			<dict>
				<key>git_hash</key>
				<string>931b885b7c2a7ff4aae86b901b747783dad5d253</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/TextSearcher.py</string>
				<key>sha256_hash</key>
				<string>e9db3755af0d3012c651f51d5820e92f1f9368cd8538ea4e633918550024195b</string>
			</dict>
			<key>com.github.jgstew.SharedProcessors/URLDownloaderPython</key>
			<dict>
				<key>git_hash</key>
				<string>8eaa294e961580527f351bb80ce0d03014d99bf3</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/SharedProcessors/URLDownloaderPython.py</string>
				<key>sha256_hash</key>
				<string>552f5d6f195cf9e56adb0146f14dc19d9480adb6f004f9cb66d68da339bc9e2b</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.jgstew.download.Firefox-Mac</key>
			<dict>
				<key>git_hash</key>
				<string>d45e6c1836f7e50a34b548890c59268c4d70136a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.jgstew.jgstew-recipes/Mozilla/Firefox-Mac.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>79e6d849d2a9b5c5efbb94055cccb28c239900f8ac18127e9554ca075c04b3de</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
