<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.iMazing</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>2</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>iMazing</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>iOS device manager.</string>
			<key>developer</key>
			<string>DigiDNA, SARL</string>
			<key>display_name</key>
			<string>iMazing</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.iMazing</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.iMazing</key>
			<dict>
				<key>git_hash</key>
				<string>3f9eaa8b6fafc66c199635fda68a67bc7a1e37f2</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/iMazing/iMazing.download.recipe</string>
				<key>sha256_hash</key>
				<string>703afd9395a49ec13fa223cbc75dc00d6abab5a128c53d855154fabc1b46db3c</string>
			</dict>
			<key>com.github.homebysix.munki.iMazing</key>
			<dict>
				<key>git_hash</key>
				<string>8a011dfd74579a361268b4c6d5cd07e7e9166b9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/iMazing/iMazing.munki.recipe</string>
				<key>sha256_hash</key>
				<string>967fb3c4ec6948214fa060eee469bfd79dd77ce0b7e789bc25381152a14d9b72</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
