<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.ParallelsDesktop</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.parallels.desktop.installer</string>
		<key>DERIVE_MIN_OS</key>
		<string>YES</string>
		<key>MAJOR_VERSION</key>
		<string>18</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Parallels Desktop</string>
		<key>PLATFORM_ARCH</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Virtualization tool for running Windows apps without rebooting.</string>
			<key>developer</key>
			<string>Parallels, Inc.</string>
			<key>display_name</key>
			<string>Parallels Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash
if [ -f /usr/local/bin/prlsrvctl ]; then
	/usr/local/bin/prlsrvctl deactivate-license
fi
exit 0
</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash

# App bundle to remove
app_Bundle="/Applications/Parallels Desktop.app/"
lib_files="/Library/Parallels/"

if [ -d "${app_Bundle}" ]
then
	/bin/echo "Found ${app_Bundle}, removing..."
	/bin/rm -rf "${app_Bundle}"
fi

if [ -d "${lib_files}" ]
then
	/bin/echo "Found ${lib_files}, removing..."
	/bin/rm -rf "${lib_files}"
fi

# Remove the pkg receipt
pkgReceipt="com.parallels.desktop.installer"

/bin/echo "Removing ${pkgReceipt}, removing..."
pkgutil --forget "${pkgReceipt}"
</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.ParallelsDesktop</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>e9c1ee7f5134760131f765045a2184e017bee94d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.download.recipe</string>
				<key>sha256_hash</key>
				<string>44f031831fa18afef4d998feb8058a862eb55c703fb782a43912dc02cec93516</string>
			</dict>
			<key>com.github.homebysix.munki.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>e6ab688369ea70357a5514b7155cd1636114f07d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.munki.recipe</string>
				<key>sha256_hash</key>
				<string>178b01eeb7fc13697e23f8c2360ef423ffe6da6a4fd87907f48b9d30e1f16a56</string>
			</dict>
			<key>com.github.homebysix.pkg.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>0632dd82b3935733ffe1590ff11af90927a3a3e5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>4f094112ae2b5e6945c0d864519fb5bc5f77fdfe818fbfc81457d4bf2588e3a7</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
