<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.Xcode</string>
	<key>Input</key>
	<dict>
		<key>HOME</key>
		<string>~</string>
		<key>NAME</key>
		<string>Xcode</string>
		<key>XIP_NAME</key>
		<string>Xcode_*.xip</string>
		<key>XIP_PATH</key>
		<string>/Users/*/Downloads</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.smithjw.pkg.Xcode</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>FileFinderMod</key>
			<dict>
				<key>git_hash</key>
				<string>8abb494f32a13eb06ae151c252595efc845d62f4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Xcode/FileFinderMod.py</string>
				<key>sha256_hash</key>
				<string>2f01684182a8e8ca003f7d2451385f9cc810967659161c0d36c2cf81876b13d1</string>
			</dict>
			<key>XcodeXIPUnpacker</key>
			<dict>
				<key>git_hash</key>
				<string>1a6cbdfb706919b4750ecc08185eb94929a34b01</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Xcode/XcodeXIPUnpacker.py</string>
				<key>sha256_hash</key>
				<string>ccd550f6c6267c01b09761f28d483c631b81b96875d3f048477b4cdedd538735</string>
			</dict>
			<key>com.github.homebysix.VersionSplitter/VersionSplitter</key>
			<dict>
				<key>git_hash</key>
				<string>cecb7b4f782a8f6b59f029d30a544df0e07c5548</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/VersionSplitter/VersionSplitter.py</string>
				<key>sha256_hash</key>
				<string>7d465a495dc3c72852472fff64af9adc39fdbd652c612fe862727e4ba78f88c9</string>
			</dict>
			<key>com.github.smithjw.processors/FriendlyPathDeleter</key>
			<dict>
				<key>git_hash</key>
				<string>c26a799a9933074405c283ed2041d94cebab027f</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/SharedProcessors/FriendlyPathDeleter.py</string>
				<key>sha256_hash</key>
				<string>0b6bd25a9286ce875da80ca2a8e61bdb59b79214d5d1e5f465eab14b5d607e6c</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.smithjw.download.Xcode</key>
			<dict>
				<key>git_hash</key>
				<string>35f2509616f861fa99fd51b6e2070062b408a50b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Xcode/Xcode.download.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>ffaa34ccf8aad9534609bf87bdd96215263c70d30e235080a7ef394ff6950712</string>
			</dict>
			<key>com.github.smithjw.extract.Xcode</key>
			<dict>
				<key>git_hash</key>
				<string>1a6cbdfb706919b4750ecc08185eb94929a34b01</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Xcode/Xcode.extract.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>37c6d9ce3a946339a7bb4b2b167f25cf53de136b013d353415a6136b201c582b</string>
			</dict>
			<key>com.github.smithjw.pkg.Xcode</key>
			<dict>
				<key>git_hash</key>
				<string>76320ec77211cb9fab18fed026d9e029e39ccb19</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Xcode/Xcode.pkg.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>28278b31a62321c9544cd65e63329647c3160999c6c4c3b3c1fef71b1bc3b9c6</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
